// Git-Demo.cpp
// 
// Системы контроля версий:
//  git, 
//  merqurial(hg), 
//  subversion(svn).
// Основные понятия:
//  Репозиторий - непосредственное хранилище 
//                отслеживаемых документов.
//                Именно репозиторий хранит всю информацию
//                о ветвях, фиксациях, и историей работы над
//                документами в репозитории.
//  фиксация(commit) - моментальный снимок текущего 
//                     состояния отслеживаемых документов.
//                     К любой фиксации можно вернутся 
//                     в любой момент времени.
//  ветки(brunch) - последовательные и связанные наборы 
//                  фиксаций. Каждая финксация должна быть 
//                  привязана к конкретоной ветке 
//                  репозитория.
// 
//  


#include <iostream>

int main()
{
    std::cout << "Hello World!\n";
}